; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l19_p19_c19_g19_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(person-at person1 loc5)
	(person-at person2 loc2)
	(person-at person3 loc6)
	(person-at person4 loc10)
	(person-at person5 loc8)
	(person-at person6 loc6)
	(person-at person7 loc17)
	(person-at person8 loc2)
	(person-at person9 loc9)
	(person-at person10 loc14)
	(person-at person11 loc6)
	(person-at person12 loc11)
	(person-at person13 loc6)
	(person-at person14 loc17)
	(person-at person15 loc7)
	(person-at person16 loc17)
	(person-at person17 loc2)
	(person-at person18 loc11)
	(person-at person19 loc3)
	(person-need person1 food)
	(person-need person1 medicine)
	(person-need person2 food)
	(person-need person2 medicine)
	(person-need person4 medicine)
	(person-need person5 medicine)
	(person-need person6 food)
	(person-need person7 medicine)
	(person-need person9 medicine)
	(person-need person10 food)
	(person-need person11 medicine)
	(person-need person12 medicine)
	(person-need person13 food)
	(person-need person13 medicine)
	(person-need person14 medicine)
	(person-need person16 medicine)
	(person-need person18 food)
	(person-need person18 medicine)
	(person-need person19 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 food)
	(has-content-person person7 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 food)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
	(has-content-person person14 medicine)
	(has-content-person person16 medicine)
	(has-content-person person18 food)
	(has-content-person person18 medicine)
	(has-content-person person19 medicine)
))
)

; plan
1. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate19 depot)
   added: (has-crate-drone-arm right crate19)
   goals met: 1 of 20
2. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 1 of 20
3. (drone-move depot loc14 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc14)
   goals met: 0 of 20
4. (drop-crate loc14 person10 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person10 food) (empty-arm left)
   goals met: 1 of 20
5. (drone-move loc14 depot drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 depot)
   goals met: 2 of 20
6. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 2 of 20
7. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 1 of 20
8. (drop-crate loc10 person4 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm right crate19)
   added: (has-content-person person4 medicine) (empty-arm right)
   goals met: 2 of 20
9. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 3 of 20
10. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate18 depot)
   added: (has-crate-drone-arm right crate18)
   goals met: 3 of 20
11. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 2 of 20
12. (drop-crate loc9 person9 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm right crate18)
   added: (has-content-person person9 medicine) (empty-arm right)
   goals met: 3 of 20
13. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 4 of 20
14. (pick-up-crate crate17 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate17 depot)
   added: (has-crate-drone-arm right crate17)
   goals met: 4 of 20
15. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 3 of 20
16. (drop-crate loc8 person5 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm right crate17)
   added: (has-content-person person5 medicine) (empty-arm right)
   goals met: 4 of 20
17. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 5 of 20
18. (pick-up-crate crate16 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate16 depot)
   added: (has-crate-drone-arm right crate16)
   goals met: 5 of 20
19. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 4 of 20
20. (drop-crate loc3 person19 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm right crate16)
   added: (has-content-person person19 medicine) (empty-arm right)
   goals met: 5 of 20
21. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 6 of 20
22. (pick-up-crate crate15 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate15 depot)
   added: (has-crate-drone-arm right crate15)
   goals met: 6 of 20
23. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 5 of 20
24. (drop-crate loc17 person7 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm right crate15)
   added: (has-content-person person7 medicine) (empty-arm right)
   goals met: 6 of 20
25. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 7 of 20
26. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate14 depot)
   added: (has-crate-drone-arm right crate14)
   goals met: 7 of 20
27. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 6 of 20
28. (drop-crate loc17 person14 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm right crate14)
   added: (has-content-person person14 medicine) (empty-arm right)
   goals met: 7 of 20
29. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 8 of 20
30. (pick-up-crate crate13 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate13 depot)
   added: (has-crate-drone-arm right crate13)
   goals met: 8 of 20
31. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 7 of 20
32. (drop-crate loc17 person16 crate13 right medicine drone1)
   deleted: (has-crate-drone-arm right crate13)
   added: (has-content-person person16 medicine) (empty-arm right)
   goals met: 8 of 20
33. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 9 of 20
34. (pick-up-crate crate12 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate12 depot)
   added: (has-crate-drone-arm right crate12)
   goals met: 9 of 20
35. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 8 of 20
36. (drop-crate loc11 person12 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm right crate12)
   added: (has-content-person person12 medicine) (empty-arm right)
   goals met: 9 of 20
37. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 10 of 20
38. (pick-up-crate crate11 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate11 depot)
   added: (has-crate-drone-arm right crate11)
   goals met: 10 of 20
39. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 9 of 20
40. (drop-crate loc11 person18 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person18 food) (empty-arm left)
   goals met: 10 of 20
41. (drop-crate loc11 person18 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm right crate11)
   added: (has-content-person person18 medicine) (empty-arm right)
   goals met: 11 of 20
42. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 12 of 20
43. (pick-up-crate crate10 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate10 depot)
   added: (has-crate-drone-arm right crate10)
   goals met: 12 of 20
44. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 12 of 20
45. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 11 of 20
46. (drop-crate loc6 person6 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person6 food) (empty-arm left)
   goals met: 12 of 20
47. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 13 of 20
48. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 13 of 20
49. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 12 of 20
50. (drop-crate loc6 person11 crate10 right medicine drone1)
   deleted: (has-crate-drone-arm right crate10)
   added: (has-content-person person11 medicine) (empty-arm right)
   goals met: 13 of 20
51. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 14 of 20
52. (pick-up-crate crate9 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate9 depot)
   added: (has-crate-drone-arm right crate9)
   goals met: 14 of 20
53. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 13 of 20
54. (drop-crate loc6 person13 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person13 food) (empty-arm left)
   goals met: 14 of 20
55. (drop-crate loc6 person13 crate9 right medicine drone1)
   deleted: (has-crate-drone-arm right crate9)
   added: (has-content-person person13 medicine) (empty-arm right)
   goals met: 15 of 20
56. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 16 of 20
57. (pick-up-crate crate8 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate8 depot)
   added: (has-crate-drone-arm right crate8)
   goals met: 16 of 20
58. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 16 of 20
59. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 15 of 20
60. (drop-crate loc5 person1 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person1 food) (empty-arm left)
   goals met: 16 of 20
61. (drop-crate loc5 person1 crate8 right medicine drone1)
   deleted: (has-crate-drone-arm right crate8)
   added: (has-content-person person1 medicine) (empty-arm right)
   goals met: 17 of 20
62. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 18 of 20
63. (pick-up-crate crate7 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate7 depot)
   added: (has-crate-drone-arm right crate7)
   goals met: 18 of 20
64. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 18 of 20
65. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 17 of 20
66. (drop-crate loc2 person2 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person2 food) (empty-arm left)
   goals met: 18 of 20
67. (drop-crate loc2 person2 crate7 right medicine drone1)
   deleted: (has-crate-drone-arm right crate7)
   added: (has-content-person person2 medicine) (empty-arm right)
   goals met: 19 of 20
68. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 20 of 20
